# Parameter Type Id Rebar Shape Type At End Property

Source: https://www.revitapidocs.com/2026/1875de83-083e-5c4f-c1e7-32d735414ad6.htm

---

| Parameter Type Id Rebar Shape Type At End Property |
| --- |

"Type At End"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarShapeTypeAtEnd { get; }
```

```
Public Shared ReadOnly Property RebarShapeTypeAtEnd As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarShapeTypeAtEnd {
	ForgeTypeId^ get ();
}
```

```
static member RebarShapeTypeAtEnd : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace